orginit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-11 Sat 03:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My settings</title>
<meta name="author" content="ZHENGBO ZHOU" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My settings</h1>
<div id="outline-container-org89e2c34" class="outline-2">
<h2 id="org89e2c34"><span class="section-number-2">1.</span> Magit</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit
  :ensure t)
</pre>
</div>
</div>
<div id="outline-container-org11e0168" class="outline-3">
<h3 id="org11e0168"><span class="section-number-3">1.1.</span> Key bindings</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>You may use <code>C-x g</code> for the <i>status buffer</i></li>
<li>Use <code>q</code> to close the status buffer</li>
<li>Use <code>g</code> to refresh the status buffer</li>
</ul>
</div>
</div>
<div id="outline-container-orgca116c1" class="outline-3">
<h3 id="orgca116c1"><span class="section-number-3">1.2.</span> Status Sections Introduction</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd813d02" class="outline-4">
<h4 id="orgd813d02"><span class="section-number-4">1.2.1.</span> Repository status</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
This section tells you which commit is current the "HEAD" of 3 important locations:
</p>
<ul class="org-ul">
<li><code>Head</code>: The current local branch</li>
<li><code>Push</code>: What you push last time.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb5b39e2" class="outline-4">
<h4 id="orgb5b39e2"><span class="section-number-4">1.2.2.</span> Untracked Files</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
This section is useful for two purpose
</p>
<ul class="org-ul">
<li>Discover any new files that you need to add your commit</li>
<li>Identify files that need to be added to your <code>.gitignore</code> file.</li>
</ul>
</div>
</div>
<div id="outline-container-org9d6f66d" class="outline-4">
<h4 id="org9d6f66d"><span class="section-number-4">1.2.3.</span> Unstaged Changes</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
This section displays the list of tracked files which have been changed since the last commit. You can use <code>&lt;TAB&gt;</code> key to see how it changed via <i>inline diff</i>.
</p>
</div>
</div>
</div>
<div id="outline-container-org6e79ba9" class="outline-3">
<h3 id="org6e79ba9"><span class="section-number-3">1.3.</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org4d206ab" class="outline-4">
<h4 id="org4d206ab"><span class="section-number-4">1.3.1.</span> Stage (add) and Commit</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>You may use <code>?</code> after <code>C-x g</code> to see the Transient commands, and you can learn all the important keybinding.</li>
<li>Stage all the cases <code>C-x g-s</code></li>
<li>Add commit &amp; commit message <code>C-x g-c-c</code>, and once you finished you may use <code>C-c C-c</code>, and your commit will be created.</li>
</ul>
</div>
</div>
<div id="outline-container-org4a6b40e" class="outline-4">
<h4 id="org4a6b40e"><span class="section-number-4">1.3.2.</span> Clone a repo</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Easiest way to do this is run <code>M-x magit-clone</code>. You need to identify the type of input you'd like to use to identify the repo. Choose <code>u</code> for "url or name" to clone a repo from GitHub. Then the magit will ask where you would like the Repo clone to.
</p>
</div>
</div>
<div id="outline-container-orgbed026c" class="outline-4">
<h4 id="orgbed026c"><span class="section-number-4">1.3.3.</span> Commit History</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
To view the commit history for the current branch. You can view the log using one of the following
</p>
<ul class="org-ul">
<li>Direct command: <code>M-x magit-log-current</code></li>
<li>Status buffer: <code>l l</code></li>
</ul>
<p>
You can close it by <code>q</code>.
</p>
</div>
</div>
<div id="outline-container-org77cdd5f" class="outline-4">
<h4 id="org77cdd5f"><span class="section-number-4">1.3.4.</span> Adding a change to the most recent commit</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Q: What if we forgot some lines that we wanted to add to this commit?
It really easy to "extend" you most recent commit with additional changes.
</p>
<ul class="org-ul">
<li><i>File</i>: Stage the changes that you want to add to the commit. Then press <code>c-e</code> (commit -&gt; Extend). Magit will "amend" the commit with those changes without asking.</li>
<li><i>File and Message</i>: If you need to edit the commit message while adding the new file, then using <code>c-a</code> (Commit -&gt; Amend). Then you can change the original commit message
<ul class="org-ul">
<li>Press <code>C-c C-c</code> to confirm the changes</li>
<li>Press <code>C-c C-k</code> to abort.</li>
</ul></li>
<li><i>Message</i>: Use <code>c-w</code> (Commit -&gt; Reword).</li>
</ul>
</div>
</div>
<div id="outline-container-org0ca32ca" class="outline-4">
<h4 id="org0ca32ca"><span class="section-number-4">1.3.5.</span> Pushing a local branch to a remote</h4>
<div class="outline-text-4" id="text-1-3-5">
<ul class="org-ul">
<li><code>P-p</code> will create a remote ("origin").</li>
</ul>
</div>
</div>
<div id="outline-container-orgb861637" class="outline-4">
<h4 id="orgb861637"><span class="section-number-4">1.3.6.</span> Adding a file to .gitignore</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
Perhaps you've got a file in Repo that you never want to see in the <i>Untracked Files</i>. You can add them into <code>.gitignore</code> files. Put your cursor on the file and press <code>i</code> to raise the <i>Gitignore</i> panel.
</p>
<ul class="org-ul">
<li><code>t</code>: Share this at toplevel, all the folders will do the same</li>
<li><code>s</code>: shared this at this subdirectory.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ZHENGBO ZHOU</p>
<p class="date">Created: 2023-03-11 Sat 03:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
